In [1]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns
import os

In [2]:
print(sns.get_dataset_names())

['anagrams', 'anscombe', 'attention', 'brain_networks', 'car_crashes', 'diamonds', 'dots', 'dowjones', 'exercise', 'flights', 'fmri', 'geyser', 'glue', 'healthexp', 'iris', 'mpg', 'penguins', 'planets', 'seaice', 'taxis', 'tips', 'titanic']

In [3]:
df=(sns.load_dataset('flights'))
df

     year month  passengers
0    1949   Jan         112
1    1949   Feb         118
2    1949   Mar         132
3    1949   Apr         129
4    1949   May         121
..    ...   ...         ...
139  1960   Aug         606
140  1960   Sep         508
141  1960   Oct         461
142  1960   Nov         390
143  1960   Dec         432

[144 rows x 3 columns]

In [3]:
def clean_year_column(year):
    if isinstance(year,str):
        year=year.replace('',',')
        year=year.strip()
        if year.isnumeric():
            year =int(year)
            return year
        if len(year)==0:
            return np.nan
    return year

In [2]:
clean_year_column('1660')

',1,6,6,0,'

In [4]:
df.head()

   year month  passengers
0  1949   Jan         112
1  1949   Feb         118
2  1949   Mar         132
3  1949   Apr         129
4  1949   May         121

In [5]:
df.tail()

     year month  passengers
139  1960   Aug         606
140  1960   Sep         508
141  1960   Oct         461
142  1960   Nov         390
143  1960   Dec         432

In [6]:
df.columns

Index(['year', 'month', 'passengers'], dtype='object')

In [7]:
df['passengers']

0      112
1      118
2      132
3      129
4      121
      ...
139    606
140    508
141    461
142    390
143    432
Name: passengers, Length: 144, dtype: int64

In [8]:
df.pop('passengers')

0      112
1      118
2      132
3      129
4      121
      ...
139    606
140    508
141    461
142    390
143    432
Name: passengers, Length: 144, dtype: int64

In [9]:
df

     year month
0    1949   Jan
1    1949   Feb
2    1949   Mar
3    1949   Apr
4    1949   May
..    ...   ...
139  1960   Aug
140  1960   Sep
141  1960   Oct
142  1960   Nov
143  1960   Dec

[144 rows x 2 columns]